# SheetMass Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..SheetMass Property
FabricSheetType Class See Also
---
The sheet mass.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double SheetMass { get; set; }
```

Visual Basic
---
```text
Public Property SheetMass As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SheetMass {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for sheetMass is not a number |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for sheetMass must be non-negative. |

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace